# 일차 방정식 : 미지수가 하나이며, 그 미지수가 특정 숫자일때만 만족하는 식
# ax + b = c
# x = (c-b)/a
# 동석이는 과일 가게에서 사과 몇개와 사과를 담을 수 있는 바구니 한개를 샀다.
# 사과 한개는 500원이고, 바구니 가격은 1000원 이다.
# 가게에 지급한 금액이 5000원 일때, 구입한 사과는 몇개인가?
# 구입한 사과의 갯수를 x라고 하면
# 500*x + 1000 = 5000
# 500*x = 1000 - 1000 = 5000 - 1000
# 500*x = 4000
# 500*x /500 = 4000/500
# x = 8

a=500
b=1000
c=5000
x = (c-b)/a
print(f'사과 한개는 {a}원이고, 바구니 가격은 {b}이다. 가게에 지금한 금액은 {c}원 일때, 구입한 사과의 갯수는 {x}개 이다')

# 2x - 3 = 5
a=2
b=-3
c=5
x=(5+3)/2
print(x)

# 3x = -7x - 10
# 3x + 7x = -10
# 10x = -10
a=10
c=-10
x = -10/10
print(x)

